Ernest4CU/Wlight/library/HT32F175x_275x_Driver/inc/ht32f175x_275x_mctm.h
/** @defgroup MCTM_BKE Definitions of MCTM break control
  * @{
  */
#define MCTM_BREAK_ENABLE           0x00000001 /*!< Break enable */
#define MCTM_BREAK_DISABLE          0x00000000 /*!< Break disable */
/**
  * @}
  */

/** @defgroup MCTM_BKP Definitions of MCTM break polarity
  * @{
  */
#define MCTM_BREAK_POLARITY_LOW     0x00000000 /*!< Break input pin active low level */
#define MCTM_BREAK_POLARITY_HIGH    0x00000002 /*!< Break input pin active high level */
/**
  * @}
  */

/** @defgroup MCTM_CHMOE Definitions of MCTM main output enable function state
  * @{
  */
#define MCTM_CHMOE_DISABLE          0x00000000 /*!< main output disable */
#define MCTM_CHMOE_ENABLE           0x00000010 /*!< Main output enable */
/**
  * @}
  */

/** @defgroup MCTM_CHAOE Definitions of MCTM automatic output enable function state
  * @{
  */
#define MCTM_CHAOE_DISABLE          0x00000000 /*!< Automatic output enable function disable */
#define MCTM_CHAOE_ENABLE           0x00000020 /*!< Automatic output enable function enable */
/**
  * @}
  */

/** @defgroup MCTM_LOCK_LEVEL Definitions of MCTM lock level selection
  * @{
  */
#define MCTM_LOCK_LEVEL_OFF                 0x00000000 /*!< Lock Off*/
#define MCTM_LOCK_LEVEL_1                   0x00010000 /*!< Lock level 1 */
#define MCTM_LOCK_LEVEL_2                   0x00020000 /*!< Lock level 2 */
#define MCTM_LOCK_LEVEL_3                   0x00030000 /*!< Lock level 3 */
/**
  * @}
  */

/** @defgroup MCTM_OSSI Definitions of Off-State Selection for Idle mode states
  * @{
  */
#define MCTM_OSSI_STATE_ENABLE              0x00100000
#define MCTM_OSSI_STATE_DISABLE             0x00000000
/**
  * @}
  */

/** @defgroup MCTM_OSSR Definitions of Off-State Selection for Run mode states
  * @{
  */
#define MCTM_OSSR_STATE_ENABLE              0x00200000
#define MCTM_OSSR_STATE_DISABLE             0x00000000
/**
  * @}
  */

/** @defgroup MCTM_Check_Parameter Check parameter
  * @{
  */

/**
 * @brief Used to check parameter of the MCTMx.
 */
#define IS_MCTM(x) (x == MCTM)
/**
 * @brief Used to check parameter of the output compare mode.
 */
#define IS_MCTM_OM_CMP(x) (((x) == MCTM_OM_MATCH_NOCHANGE) || \
                           ((x) == MCTM_OM_MATCH_INACTIVE) || \
                           ((x) == MCTM_OM_MATCH_ACTIVE) || \
                           ((x) == MCTM_OM_MATCH_TOGGLE)|| \
                           ((x) == MCTM_OM_PWM1) || \
                           ((x) == MCTM_OM_PWM2))

/**
 * @brief Used to check parameter of the output mode.
 */
#define IS_MCTM_OM(x) (((x) == MCTM_OM_MATCH_NOCHANGE) || \
                       ((x) == MCTM_OM_MATCH_INACTIVE) || \
                       ((x) == MCTM_OM_MATCH_ACTIVE) || \
                       ((x) == MCTM_OM_MATCH_TOGGLE)|| \
                       ((x) == MCTM_OM_PWM1) || \
                       ((x) == MCTM_OM_PWM2) || \
                       ((x) == MCTM_OM_FORCED_INACTIVE) || \
                       ((x) == MCTM_OM_FORCED_ACTIVE))
/**
 * @brief Used to check parameter of the channel .
 */
#define IS_MCTM_CH(x) (((x) == MCTM_CH_0) || ((x) == MCTM_CH_1) || \
                       ((x) == MCTM_CH_2) || ((x) == MCTM_CH_3))
/**
 * @brief Used to check parameter of the complementary output channel.
 */
#define IS_MCTM_COMPLEMENTARY_CH(x) (((x) == MCTM_CH_0) || ((x) == MCTM_CH_1) || \
                                     ((x) == MCTM_CH_2))
/**
 * @brief Used to check parameter of the channel for PWM input function .
 */
#define IS_MCTM_CH_PWMI(x) (((x) == MCTM_CH_0) || ((x) == MCTM_CH_1))
/**
 * @brief Used to check parameter of the clock divider.
 */
#define IS_MCTM_CKDIV(x)  ((x == MCTM_CKDIV_OFF) || \
                           (x == MCTM_CKDIV_2) || \
                           (x == MCTM_CKDIV_4))
/**
 * @brief Used to check parameter of the counter mode.
 */
#define IS_MCTM_CNT_MODE(x) ((x == MCTM_CNT_MODE_UP) ||  \
                             (x == MCTM_CNT_MODE_CA1) || \
                             (x == MCTM_CNT_MODE_CA2) || \
                             (x == MCTM_CNT_MODE_CA3) || \
                             (x == MCTM_CNT_MODE_DOWN))
/**
 * @brief Used to check parameter of the polarity.
 */
#define IS_MCTM_CHP(x)  ((x == MCTM_CHP_NONINVERTED) || (x == MCTM_CHP_INVERTED))
/**
 * @brief Used to check parameter of the COMUS.
 */
#define IS_MCTM_COMUS(x)  ((x == MCTM_COMUS_STIOFF) || (x == MCTM_COMUS_STION))
/**
 * @brief Used to check parameter of the channel output idle state.
 */
#define IS_MCTM_OIS(x)  ((x == MCTM_OIS_LOW) || (x == MCTM_OIS_HIGH))
/**
 * @brief Used to check parameter of the channel control.
 */
#define IS_MCTM_CHCTL(x)  ((x == MCTM_CHCTL_DISABLE) || (x == MCTM_CHCTL_ENABLE))
/**
 * @brief Used to check parameter of the channel capture / compare PDMA selection.
 */
#define IS_MCTM_CHCCDS(x) ((x == MCTM_CHCCDS_CHCCEV) || (x == MCTM_CHCCDS_UEV1))
/**
 * @brief Used to check parameter of the channel input selection .
 */
#define IS_MCTM_CHCCS(x) ((x == MCTM_CHCCS_DIRECT) || \
                           (x == MCTM_CHCCS_INDIRECT) || \
                           (x == MCTM_CHCCS_TRCED))
/**
 * @brief Used to check parameter of the channel capture prescaler .
 */
#define IS_MCTM_CHPSC(x) ((x == MCTM_CHPSC_OFF) || \
                           (x == MCTM_CHPSC_2) || \
                           (x == MCTM_CHPSC_4) || \
                           (x == MCTM_CHPSC_8))
/**
 * @brief Used to check parameter of the ETI prescaler.
 */
#define IS_MCTM_ETIPSC(x) ((x == MCTM_ETIPSC_OFF) || \
                           (x == MCTM_ETIPSC_2) || \
                           (x == MCTM_ETIPSC_4) || \
                           (x == MCTM_ETIPSC_8))
/**
 * @brief Used to check parameter of the MCTM interrupt .
 */
#define IS_MCTM_INT(x) (((x & 0xFFFFF0F0) == 0x0) && (x != 0))
/**
 * @brief Used to check parameter of the MCTM PDMA request .
 */
#define IS_MCTM_PDMA(x) (((x & 0xF8F0FFFF) == 0x0) && (x != 0))
/**
 * @brief Used to check parameter of the MCTM interrupt for \ref MCTM_GetIntStatus function .
 */
#define IS_MCTM_GET_INT(x)  ((x == MCTM_INT_CH0CC) || \
                             (x == MCTM_INT_CH1CC) || \
                             (x == MCTM_INT_CH2CC) || \
                             (x == MCTM_INT_CH3CC) || \
                             (x == MCTM_INT_UEV1) || \
                             (x == MCTM_INT_UEV2) || \
                             (x == MCTM_INT_TEV) || \
                             (x == MCTM_INT_BRKEV))
/**
 * @brief Used to check parameter of the MCTM STI selection .
 */
#define IS_MCTM_TRSEL(x) ((x == MCTM_TRSEL_UEV1G) || \
                           (x == MCTM_TRSEL_TI0S0) || \
                           (x == MCTM_TRSEL_TI1S1) || \
                           (x == MCTM_TRSEL_ETIF) || \
                           (x == MCTM_TRSEL_TI0BED) || \
                           (x == MCTM_TRSEL_ITI1) || \
                           (x == MCTM_TRSEL_ITI2))
/**
 * @brief Used to check parameter of the ITI .
 */
#define IS_MCTM_ITI(x)  ((x == MCTM_TRSEL_ITI1) || (x == MCTM_TRSEL_ITI2))
/**
 * @brief Used to check parameter of the MCTM_TRSEL for \ref MCTM_ChExternalClockConfig function.
 */
#define IS_MCTM_TRSEL_CH(x)  ((x == MCTM_TRSEL_TI0S0) || (x == MCTM_TRSEL_TI1S1) || \
                               (x == MCTM_TRSEL_TI0BED))
/**
 * @brief Used to check parameter of the MCTM ETI polarity .
 */
#define IS_MCTM_ETIPOL(x) ((x == MCTM_ETIPOL_NONINVERTED) || (x == MCTM_ETIPOL_INVERTED))
/**
 * @brief Used to check parameter of the MCTM prescaler reload time .
 */
#define IS_MCTM_PSC_RLD(x) ((x == MCTM_PSC_RLD_UPDATE) || (x == MCTM_PSC_RLD_IMMEDIATE))
/**
 * @brief Used to check parameter of the forced action .
 */
#define IS_MCTM_OM_FORCED(x) ((x == MCTM_OM_FORCED_ACTIVE) || (x == MCTM_OM_FORCED_INACTIVE) )
/**
 * @brief Used to check parameter of the decoder mode .
 */
#define IS_MCTM_SMSEL_DECODER(x)  ((x == MCTM_SMSEL_DECODER1) || (x == MCTM_SMSEL_DECODER2) || \
                                   (x == MCTM_SMSEL_DECODER3))
/**
 * @brief Used to check parameter of the event .
 */
#define IS_MCTM_EVENT(x)  (((x & 0xFFFFF0F0) == 0x0000) && (x != 0x0000))
/**
 * @brief Used to check parameter of the MCTM master mode selection.
 */
#define IS_MCTM_MMSEL(x)  (((x) == MCTM_MMSEL_RESET) || \
                           ((x) == MCTM_MMSEL_ENABLE) || \
                           ((x) == MCTM_MMSEL_UPDATE) || \
                           ((x) == MCTM_MMSEL_CH0CC) || \
                           ((x) == MCTM_MMSEL_CH0OREF) || \
                           ((x) == MCTM_MMSEL_CH1OREF) || \
                           ((x) == MCTM_MMSEL_CH2OREF) || \
                           ((x) == MCTM_MMSEL_CH3OREF))
/**
 * @brief Used to check parameter of the MCTM slave mode .
 */
#define IS_MCTM_SLAVE_MODE(x) ((x == MCTM_SMSEL_RESTART) || (x == MCTM_SMSEL_PAUSE) || \
                               (x == MCTM_SMSEL_TRIGGER) || (x == MCTM_SMSEL_STIED))
/**
 * @brief Used to check parameter of the MCTM flag.
 */
#define IS_MCTM_FLAG(x) ((x == MCTM_FLAG_CH0CC) || \
                         (x == MCTM_FLAG_CH1CC) || \
                         (x == MCTM_FLAG_CH2CC) || \
                         (x == MCTM_FLAG_CH3CC) || \
                         (x == MCTM_FLAG_CH0OC) || \
                         (x == MCTM_FLAG_CH1OC) || \
                         (x == MCTM_FLAG_CH2OC) || \
                         (x == MCTM_FLAG_CH3OC) || \
                         (x == MCTM_FLAG_UEV1) || \
                         (x == MCTM_FLAG_UEV2) || \
                         (x == MCTM_FLAG_TEV) || \
                         (x == MCTM_FLAG_BRKEV))
/**
 * @brief Used to check parameter of the MCTM flag for \ref MCTM_ClearFlag function.
 */
#define IS_MCTM_FLAG_CLR(x) (((x & 0xFFFFF000) == 0) && (x != 0))
/**
 * @brief Used to check value of MCTM digital filter.
 */
#define IS_MCTM_FILTER(x) (x <= 0xF)
/**
 * @brief Used to check value of MCTM break control state.
 */
#define IS_MCTM_BREAK_STATE(STATE)  (((STATE) == MCTM_BREAK_ENABLE) || \
                                     ((STATE) == MCTM_BREAK_DISABLE))
/**
 * @brief Used to check value of MCTM break polarity.
 */
#define IS_MCTM_BREAK_POLARITY(POLARITY)    (((POLARITY) == MCTM_BREAK_POLARITY_LOW) || \
                                             ((POLARITY) == MCTM_BREAK_POLARITY_HIGH))
/**
 * @brief Used to check value of MCTM automatic output enable control state.
 */
#define IS_MCTM_CHAOE_STATE(STATE)  (((STATE) == MCTM_CHAOE_ENABLE) || \
                                     ((STATE) == MCTM_CHAOE_DISABLE))
/**
 * @brief Used to check value of MCTM lock level.
 */
#define IS_MCTM_LOCK_LEVEL(LEVEL)   (((LEVEL) == MCTM_LOCK_LEVEL_OFF) || \
                                     ((LEVEL) == MCTM_LOCK_LEVEL_1) || \
                                     ((LEVEL) == MCTM_LOCK_LEVEL_2) || \
                                     ((LEVEL) == MCTM_LOCK_LEVEL_3))
/**
 * @brief Used to check value of MCTM OSSI state.
 */
#define IS_MCTM_OSSI_STATE(STATE)   (((STATE) == MCTM_OSSI_STATE_ENABLE) || \
                                     ((STATE) == MCTM_OSSI_STATE_DISABLE))
/**
 * @brief Used to check value of MCTM OSSR state.
 */
#define IS_MCTM_OSSR_STATE(STATE)   (((STATE) == MCTM_OSSR_STATE_ENABLE) || \
                                     ((STATE) == MCTM_OSSR_STATE_DISABLE))

/**
  * @}
  */

/**
  * @}
  *//* End of MCTM_Exported_Constants group */

