Ernest4CU/Wlight/library/HT32F175x_275x_Driver/inc/ht32f175x_275x_mctm.h
/** @defgroup MCTM_Exported_Functions MCTM exported functions
  * @{
  */
void MCTM_DeInit(MCTM_TypeDef* MCTMx);
void MCTM_TimeBaseInit(MCTM_TypeDef* MCTMx, MCTM_TimeBaseInitTypeDef* TimeBaseInit);
void MCTM_OutputInit(MCTM_TypeDef* MCTMx, MCTM_OutputInitTypeDef* OutInit) ;
void MCTM_CaptureInit(MCTM_TypeDef* MCTMx, MCTM_CaptureInitTypeDef* CapInit);
void MCTM_PwmInputInit(MCTM_TypeDef* MCTMx, MCTM_CaptureInitTypeDef* CapInit);
void MCTM_TimeBaseStructInit(MCTM_TimeBaseInitTypeDef* TimeBaseInit);
void MCTM_OutputStructInit(MCTM_OutputInitTypeDef* OutInit);
void MCTM_CaptureStructInit(MCTM_CaptureInitTypeDef* CapInit);
void MCTM_Cmd(MCTM_TypeDef* MCTMx, ControlStatus NewState);
void MCTM_ItiExternalClockConfig(MCTM_TypeDef* MCTMx, MCTM_TRSEL_Enum Iti);
void MCTM_ChExternalClockConfig(MCTM_TypeDef* MCTMx, MCTM_TRSEL_Enum Sel, MCTM_CHP_Enum Pol, u8 Filter);
void MCTM_EtiExternalClockConfig(MCTM_TypeDef* MCTMx, MCTM_ETIPSC_Enum Psc, MCTM_ETIPOL_Enum Pol, u8 Filter);
void MCTM_EtiConfig(MCTM_TypeDef* MCTMx, MCTM_ETIPSC_Enum Psc, MCTM_ETIPOL_Enum Pol, u8 Filter);
void MCTM_PrescalerConfig(MCTM_TypeDef* MCTMx, u16 Psc, MCTM_PSC_RLD_Enum PscReloadTime);
void MCTM_CounterModeConfig(MCTM_TypeDef* MCTMx, MCTM_CNT_MODE_Enum Mod);
void MCTM_StiConfig(MCTM_TypeDef* MCTMx, MCTM_TRSEL_Enum Sel);
void MCTM_DecoderConfig(MCTM_TypeDef* MCTMx, MCTM_SMSEL_Enum DecoderMod,
                        MCTM_CHP_Enum CH0P, MCTM_CHP_Enum CH1P);
void MCTM_ForcedOREF0(MCTM_TypeDef* MCTMx, MCTM_OM_Enum ForcedAction);
void MCTM_ForcedOREF1(MCTM_TypeDef* MCTMx, MCTM_OM_Enum ForcedAction);
void MCTM_ForcedOREF2(MCTM_TypeDef* MCTMx, MCTM_OM_Enum ForcedAction);
void MCTM_ForcedOREF3(MCTM_TypeDef* MCTMx, MCTM_OM_Enum ForcedAction);
void MCTM_CRRPreloadCmd(MCTM_TypeDef* MCTMx, ControlStatus NewState);
void MCTM_CHCCRPreloadConfig(MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, ControlStatus NewState) ;
void MCTM_ClearOREFConfig(MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, ControlStatus NewState) ;
void MCTM_ChPolarityConfig(MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, MCTM_CHP_Enum Pol);
void MCTM_ChNPolarityConfig(MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, MCTM_CHP_Enum Pol);
void MCTM_ImmActiveConfig(MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, ControlStatus NewState);
void MCTM_ChannelConfig(MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, MCTM_CHCTL_Enum Control);
void MCTM_ChannelNConfig(MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, MCTM_CHCTL_Enum Control);
void MCTM_OutputModeConfig(MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, MCTM_OM_Enum Mod);
void MCTM_UpdateCmd(MCTM_TypeDef* MCTMx, ControlStatus NewState);
void MCTM_UEV1G_IntConfig(MCTM_TypeDef* MCTMx, ControlStatus NewState);
void MCTM_HallInterfaceCmd(MCTM_TypeDef* MCTMx, ControlStatus NewState);
void MCTM_SinglePulseModeCmd(MCTM_TypeDef* MCTMx, ControlStatus NewState);
void MCTM_MMSELConfig(MCTM_TypeDef* MCTMx, MCTM_MMSEL_Enum Sel);
void MCTM_SlaveModeConfig(MCTM_TypeDef* MCTMx, MCTM_SMSEL_Enum Sel);
void MCTM_TimSyncCmd(MCTM_TypeDef* MCTMx, ControlStatus NewState);
void MCTM_SetCounter(MCTM_TypeDef* MCTMx, u16 Counter);
void MCTM_SetCounterReload(MCTM_TypeDef* MCTMx, u16 Reload);
void MCTM_SetCaptureCompare0(MCTM_TypeDef* MCTMx, u16 Cmp);
void MCTM_SetCaptureCompare1(MCTM_TypeDef* MCTMx, u16 Cmp);
void MCTM_SetCaptureCompare2(MCTM_TypeDef* MCTMx, u16 Cmp);
void MCTM_SetCaptureCompare3(MCTM_TypeDef* MCTMx, u16 Cmp);
void MCTM_CHPSCConfig(MCTM_TypeDef* MCTMx, MCTM_CH_Enum Channel, MCTM_CHPSC_Enum Psc) ;
void MCTM_CKDIVConfig(MCTM_TypeDef* MCTMx, MCTM_CKDIV_Enum Div);
u32 MCTM_GetCaptureCompare0(MCTM_TypeDef* MCTMx);
u32 MCTM_GetCaptureCompare1(MCTM_TypeDef* MCTMx);
u32 MCTM_GetCaptureCompare2(MCTM_TypeDef* MCTMx);
u32 MCTM_GetCaptureCompare3(MCTM_TypeDef* MCTMx);
u32 MCTM_GetCounter(MCTM_TypeDef* MCTMx);
u32 MCTM_GetPrescaler(MCTM_TypeDef* MCTMx);
void MCTM_GenerateEvent(MCTM_TypeDef* MCTMx, u32 MCTM_EVENT);
FlagStatus MCTM_GetFlagStatus(MCTM_TypeDef* MCTMx, u32 MCTM_FLAG);
void MCTM_ClearFlag(MCTM_TypeDef* MCTMx, u32 MCTM_FLAG);
void MCTM_IntConfig(MCTM_TypeDef* MCTMx, u32 MCTM_INT, ControlStatus NewState);
FlagStatus MCTM_GetIntStatus(MCTM_TypeDef* MCTMx, u32 MCTM_INT);
void MCTM_ClearIntPendingBit(MCTM_TypeDef* MCTMx, u32 MCTM_INT);
void MCTM_InternalClockConfig(MCTM_TypeDef* MCTMx);

void MCTM_CHMOECmd(MCTM_TypeDef* MCTMx, ControlStatus NewState);
void MCTM_CHBRKCTRConfig(MCTM_TypeDef* MCTMx, MCTM_CHBRKCTRInitTypeDef *CHBRKCTRInit);
void MCTM_CHBRKCTRStructInit(MCTM_CHBRKCTRInitTypeDef* CHBRKCTRInit);

void MCTM_COMPRECmd(MCTM_TypeDef* MCTMx, ControlStatus NewState);
void MCTM_COMUSConfig(MCTM_TypeDef* MCTMx, MCTM_COMUS_Enum Sel);
void MCTM_CHCCDSConfig(MCTM_TypeDef* MCTMx, MCTM_CHCCDS_Enum Selection);
void MCTM_PDMAConfig(MCTM_TypeDef* MCTMx, u32 MCTM_PDMA, ControlStatus NewState);

#ifdef __cplusplus
}
#endif

/**
  * @}
  *//* End of MCTM_Exported_Functions group */

/**
  * @}
  *//* End of MCTM group */

/**
  * @}
  *//* End of HT32F175x_275x_Peripheral_Driver group */

#endif /* __HT32F175x_275x_MCTM_H -------------------------------------------------------------------------------*/
